app/controllers/survey_entries_controller.rb

  def create
    SurveyEntry.create(:choice => params[:choice])
---
INSERT INTO "survey_entries" ("choice", "created_at", "updated_at") VALUES ('ruby', '2011-05-18 18:30:03.277249', '2011-05-18 18:30:03.277249')